{
  "main": {
    "name":"Nathan Moeller",
    "description": "I am a software engineer currently working for IBM in San Jose. I am originally from the midwest, where I attended school at the University of Wisconsin - Madison and the University of Minnesota - Twin Cities.",
    "image":"profilepic2.jpg",
    "bio": "Software engineer and soccer player. Shoot me an email to find out more about me!",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "n.moeller18@gmail.com",
    "phone": "612-600-0530",
    "address":{
      "street":"301 Laurel Grove Lane",
      "city":"San Jose",
      "state":"California",
      "zip": "95126"
    },
    "website": "http://www.nathanmoeller.com",
    "resumedownload":"http://www.nathanmoeller.com/resume",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/nathan-moeller-63006a8a/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/NateMoeller",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "education":[
      {
        "school":"University of Minnesota - Twin Cities",
        "degree":"Master's in computer science",
        "graduated":"May 2016",
        "description":"While in graudate school I took a variety of classes including Artificial Intelligence, machine learning, robotics, and experimental games. After taking software engineering and a class called \"Developing the Interactive Web\", I decided I wanted to pursue software engineering as a career.",
        "image": "umn_logo.jpg"
      },
      {
        "school":"University of Wisconsin - Madison",
        "degree":"Bachlor's in computer science",
        "graduated":"May 2014",
        "description":"While in undergraduate school I took many classes to grow my knowledge and interest in computer science. I really enjoyed taking classes like algorithms, graphics, and database systems.",
        "image": "uw_logo.png"
      }
    ]
  },
  "projects": [
    {
      "name": "Bounty Streamer",
      "years": "May 2018 - May 2019",
      "link": "https://bountystreamer.gg",
      "description": "Bounty Streamer is a web application designed for twith streaming where viewers can incentivize streamers to complete in game challenges for real money. We developed this project as a team a 3 and used a Java Spring backend, React frontend and PayPal/Twitch/AWS REST APIs and services."
    },
    {
      "name": "Word Affects",
      "years": "October 2013 - May 2014",
      "link": "http://www.wordaffects.com",
      "description": "Word Affects is a twitter seniment analysis web application that we developed for the UW Madison 2014 CS NEST competition. For this project we won 3rd place for implementing a Naive Bayes classifier and a web interface to see a real time classification of tweets."
    },
    {
      "name": "The Infected Dungeon Game",
      "years": "February 2016 - May 2016",
      "link": "https://www.youtube.com/watch?v=OtyZlVXh-rk&feature=emb_logo",
      "description": "The Infected Dungeon Game is a game I made in Unity for Experimental Games and Technologies. It is a first person survival shooter game that adjusts in difficulty to the player's skill level."
    },
    {
      "name": "Focused Web Crawler Classifier",
      "years": "September 2015 - December 2015",
      "link": "http://nathanmoeller.com/documents/patent_report.pdf",
      "description": "For class \"Intelligent Agents\" in graduate school, I implemented a neural network classifier to detect patent related web pages to use in a focused web crawler. For this project I worked by myself and coded in Python."
    }
  ]
}
